pegvin/CH32V003/src/main.c
#include <ch32v00x.h>
#include <debug.h>

#define BLINK_GPIO_PORT    GPIOC
#define BLINK_GPIO_PIN     GPIO_Pin_1
#define BLINK_CLOCK_ENABLE RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE)

// WCH-Interrupt-fast can be properly emulated in standard GCC but this is a minimal example
void NMI_Handler(void); //__attribute__((interrupt("WCH-Interrupt-fast")));
void HardFault_Handler(void); //__attribute__((interrupt("WCH-Interrupt-fast")));

int main(void) {
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
	SystemCoreClockUpdate();
	Delay_Init();

	GPIO_InitTypeDef GPIO_InitStructure = {0};

	BLINK_CLOCK_ENABLE;
	GPIO_InitStructure.GPIO_Pin = BLINK_GPIO_PIN;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(BLINK_GPIO_PORT, &GPIO_InitStructure);

	uint8_t ledState = 0;
	while (1) {
		GPIO_WriteBit(BLINK_GPIO_PORT, BLINK_GPIO_PIN, ledState);
		ledState ^= 1; // invert for the next run
		Delay_Ms(1000);
	}

	return 0;
}

void NMI_Handler(void) {}
void HardFault_Handler(void) {
	while (1) {
	}
}
